package src.API.regex;

public class 非捕获分组 {
    public static void main(String[] args) {
        /*
        非捕获分组:分组之间不需要再用本组数据，仅仅是把数据括起来

        身份证号码:
41080119930228457x
510801197609022309
15040119810705387X
130133197204039024
430102197606046442
         */

        //身份证号码的简易正则表达式
        //仅仅是把数据括起来
        //特点:不占用组号

        //这里的\\1为什么会报错:(?:)就是非分组，此时是不占用组号的
        //(?:) (?=) (?!)  都是非捕获分组
        //更多的使用第一个
        String regex1 = "[1-9]\\d{16}(\\d|x|x)\\1";
        //String regex = "[1-9]\\d{16}(?:\\d|x|x)\\1";
        System.out.println("41080119930228457x".matches(regex1));
    }
}
